In [1]:
import pandas as pd

In [2]:
empt_df = pd.DataFrame()
print(empt_df)

Empty DataFrame
Columns: []
Index: []

In [3]:
lst = ['a','b','c']
print(lst)

['a', 'b', 'c']

In [6]:
df  = pd.DataFrame(lst)
print(df)

   0
0  a
1  b
2  c

In [7]:
df

   0
0  a
1  b
2  c

In [8]:
lst_of_lst = [[1,2,3],[4,5,6],[7,8,9]]
print(lst_of_lst)

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [9]:
s3 = pd.DataFrame(lst_of_lst)
print(s3)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
s3

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
dic1 = {'ID':[1,2,3],'Location':[4,5,6],'Address':[7,8,9]}
print(dic1)
type(dic1)

{'ID': [1, 2, 3], 'Location': [4, 5, 6], 'Address': [7, 8, 9]}

dict

In [18]:
dic_df = pd.DataFrame(dic1)
dic_df

   ID  Location  Address
0   1         4        7
1   2         5        8
2   3         6        9

In [19]:
list_od_dic = [{'a':1,'b':2}, {'a':5,'b':4,'c':9}]

In [20]:
s4= pd.DataFrame(list_od_dic)
s4

   a  b    c
0  1  2  NaN
1  5  4  9.0